case/outputs_shutin/openfoam_cases/section_2_x24p5km/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.000148267;

boundaryField
{
    inlet   { type fixedValue; value uniform 0.000148267; }
    outlet  { type inletOutlet; inletValue uniform 0.000148267; value uniform 0.000148267; }
    walls   { type kqRWallFunction; value uniform 0.000148267; }
}
